In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("train.csv")

In [5]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [6]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

What was the average price for each passenger class?

In [7]:
df.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [8]:
df.groupby("Pclass")["Age"].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [10]:
df.groupby("Sex")["Fare"].median()

Sex
female    23.0
male      10.5
Name: Fare, dtype: float64

In [9]:
df["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [11]:
df["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

Aggregate different functions

In [12]:
df.groupby("Sex")["Age"].agg(["min","max","mean"])

         min   max       mean
Sex
female  0.75  63.0  27.915709
male    0.42  80.0  30.726645

In [14]:
df["Name"].nunique()

891

In [15]:
len(df)

891

In [16]:
df["Name"].value_counts()

Braund, Mr. Owen Harris                     1
Boulos, Mr. Hanna                           1
Frolicher-Stehli, Mr. Maxmillian            1
Gilinski, Mr. Eliezer                       1
Murdlin, Mr. Joseph                         1
                                           ..
Kelly, Miss. Anna Katherine "Annie Kate"    1
McCoy, Mr. Bernard                          1
Johnson, Mr. William Cahoone Jr             1
Keane, Miss. Nora A                         1
Dooley, Mr. Patrick                         1
Name: Name, Length: 891, dtype: int64

In [22]:
df["Age"].value_counts(dropna=False) #do not drop N/A values

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: Age, Length: 89, dtype: int64

In [18]:
df["Age"].nunique()

88

Groupby multiple variables

In [23]:
df.groupby(["Pclass", "Survived"])["Fare"].mean()

Pclass  Survived
1       0           64.684007
        1           95.608029
2       0           19.412328
        1           22.055700
3       0           13.669364
        1           13.694887
Name: Fare, dtype: float64

In [24]:
grouped = df.groupby(["Pclass", "Survived"])["Fare"].mean().reset_index()

In [25]:
grouped

   Pclass  Survived       Fare
0       1         0  64.684007
1       1         1  95.608029
2       2         0  19.412328
3       2         1  22.055700
4       3         0  13.669364
5       3         1  13.694887